БухЭксп/Enums/CW_ВидыОперацийДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперацийДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщикуПоПриобретениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперативнойЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_ВзаиморасчетыПоДокументуСервер/Ext/Module.bsl
Процедура УстановитьНазваниеСсылкиОтчета(Форма, ПоказыватьЗадолженность = Истина) Экспорт             
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	Ссылка 		= Форма.Объект.Ссылка;  
	
	ВидЗадолженности 			= ПолучитьВидЗадолженностиПоТипуДокумента(Ссылка);
	СоответствиеИменРегистров 	= ПолучитьСоответствиеИменРегистров();
	ИмяРегистра 				= СоответствиеИменРегистров.Получить(ВидЗадолженности);
	Если ИмяРегистра = Неопределено 
		ИЛИ НЕ ПоказыватьЗадолженность Тогда
		Элементы.Команда_ВзаиморасчетыПоДокументу.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	СальдоПоДокументу = 0;
	Если НЕ Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОперативнаяЗадолженностьОстатки.Счет КАК Счет,
		|	ОперативнаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Всего_ВалютаОстаток
		|ИЗ
		|	РегистрНакопления."+ИмяРегистра+".Остатки(, Счет = &Счет) КАК ОперативнаяЗадолженностьОстатки";
		
		Запрос.УстановитьПараметр("Счет", Ссылка);  
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СальдоПоДокументу = Выборка.Всего_ВалютаОстаток;	
		КонецЕсли;
		
	КонецЕсли;               
	
	стрВалюта = ?(СальдоПоДокументу = 0, "", СокрЛП(Объект.Валюта));   
	
	Заголовок = "Задолженность отсутствует";
	Если СальдоПоДокументу <> 0 Тогда
		Заголовок = "Задолженность: "+Формат(СальдоПоДокументу, "ЧДЦ=2;");
	КонецЕсли;
	
	ЦветТекста = Новый Цвет();
	Если СальдоПоДокументу < 0 Тогда
		ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;
	
	Элементы.Команда_ВзаиморасчетыПоДокументу.Заголовок  = СокрЛП(Заголовок) +" "+стрВалюта;
	Элементы.Команда_ВзаиморасчетыПоДокументу.ЦветТекста = ЦветТекста;
	Попытка
		Элементы.Команда_ВзаиморасчетыПоДокументу1.Заголовок = СокрЛП(Заголовок) +" "+стрВалюта;
		Элементы.Команда_ВзаиморасчетыПоДокументу1.ЦветТекста = ЦветТекста;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьВидЗадолженностиПоТипуДокумента(Знач Ссылка)
	
	ВидЗадолженности = "";
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств") Тогда
		Если Ссылка.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя") 
			ИЛИ Ссылка.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратПокупателю")  Тогда
			ВидЗадолженности ="ДЕБИТОРСКАЯ";
		ИначеЕсли Ссылка.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ОплатаПоставщику")
			ИЛИ Ссылка.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратОтПоставщика") Тогда
			ВидЗадолженности ="КРЕДИТОРСКАЯ";
		ИначеЕсли Ссылка.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям") Тогда
			ВидЗадолженности ="КРЕДИТОРСКАЯ";
		КонеЦЕсли;	 
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_Оплата") Тогда
		Если Ссылка.ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
			ВидЗадолженности ="ДЕБИТОРСКАЯ";
		ИначеЕсли Ссылка.ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
			ВидЗадолженности ="КРЕДИТОРСКАЯ";
		КонецЕсли;
	КонецЕсли;   
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		ВидЗадолженности ="ДЕБИТОРСКАЯ";
	КонецЕсли;   
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		ВидЗадолженности ="КРЕДИТОРСКАЯ";
	КонецЕсли;  
	
	Возврат ВидЗадолженности;

КонецФункции

Функция ПолучитьСоответствиеИменРегистров()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ДЕБИТОРСКАЯ",  "CW_ОперативнаяДебиторскаяЗадолженность");
	Соответствие.Вставить("КРЕДИТОРСКАЯ", "CW_ОперативнаяКредиторскаяЗадолженность");

	Возврат Соответствие;
	
КонецФункции
